/*Задание 1. Создание таблицы Book со столбцами book_id, title, author, price, amount.
*/
CREATE TABLE book(  
    book_id int PRIMARY KEY AUTO_INCREMENT,
    title varchar(50),
    author varchar(30),
    price DECIMAL(8, 2),
    amount int
);


/*Пример -- Пример запроса на добавление 3 новых строк в таблицу.
    Заполняются они поочерёдно. INSERT INTO __ (a, b, c)
                                VALUES ('a1', 'b2', 'c3');
                                etc...
                                
*/
INSERT INTO book (title, author, price, amount) 
Values ('Белая гвардия', 'Булгаков М.А.', 540.50, 5);
INSERT INTO book (title, author, price, amount)
Values ('Идиот', 'Достоевский Ф.М.', 460.00, 10);
INSERT INTO book (title, author, price, amount)
Values ('Братья Карамазовы', 'Достоевский Ф.М.', 799.01, 2);
SELECT * FROM book;



/*Пример как добавить новый столбец (цена книги = стоймость страницы 1.65 * на количество)
 round(x, k) x - что округляем, k - число до знаков.
*/
SELECT title, amount,   -- добавил новый столбец как стоимость книги (1 стр -1.65 коп)
    1.65 * amount as pack
from book


/*Пример как добавить новый столбец (цена со скидкой 30%) 
 round(x, k) x - что округляем, k - число до знаков.
*/
SELECT title, author, amount,
    round((price*70/100), 2) AS new_price
FROM book;





/*Пример как добавлять столбцы с условием. Если автор = такой-то, то цена меняется. + округление.


 Усложним вычисление скидки в зависимости от количества книг. Если количество книг меньше 4 – то скидка 50%, меньше 11 – 30%, в остальных случаях – 10%. И еще укажем какая именно скидка на каждую книгу.

Запрос:

SELECT title, amount, price,
    ROUND(IF(amount < 4, price * 0.5, IF(amount < 11, price * 0.7, price * 0.9)), 2) AS sale,
    IF(amount < 4, 'скидка 50%', IF(amount < 11, 'скидка 30%', 'скидка 10%')) AS Ваша_скидка
FROM book;
Результат:

+-----------------------+--------+--------+--------+-------------+
| title                 | amount | price  | sale   | Ваша_скидка |
+-----------------------+--------+--------+--------+-------------+
| Мастер и Маргарита    | 3      | 670.99 | 335.50 | скидка 50%  |
| Белая гвардия         | 5      | 540.50 | 378.35 | скидка 30%  |
| Идиот                 | 10     | 460.00 | 322.00 | скидка 30%  |
| Братья Карамазовы     | 2      | 799.01 | 399.51 | скидка 50%  |
| Стихотворения и поэмы | 15     | 650.00 | 585.00 | скидка 10%  |
+-----------------------+--------+--------+--------+-------------+
*/
SELECT author, title,
    ROUND(IF(author = "Булгаков М.А.", price * 1.1, 
    IF(author = "Есенин С.А.", price * 1.05, price)), 2)
    AS new_price    
FROM book
/*
Query result:
+------------------+-----------------------+-----------+
| author           | title                 | new_price |
+------------------+-----------------------+-----------+
| Булгаков М.А.    | Мастер и Маргарита    | 738.09    |
| Булгаков М.А.    | Белая гвардия         | 594.55    |
| Достоевский Ф.М. | Идиот                 | 460.00    |
| Достоевский Ф.М. | Братья Карамазовы     | 799.01    |
| Есенин С.А.      | Стихотворения и поэмы | 682.50    |
+------------------+-----------------------+-----------+
Affected rows: 5
*/